test1024.txt
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 500
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 3.146 ms
initial connection time = 8.878 ms
tps = 635.743267 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 500
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 2.751 ms
initial connection time = 6.859 ms
tps = 727.098752 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 250
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 5.776 ms
initial connection time = 17.577 ms
tps = 692.490563 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 250
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 6.521 ms
initial connection time = 51.089 ms
tps = 613.408120 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 125
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 13.454 ms
initial connection time = 65.282 ms
tps = 594.605619 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 125
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 12.704 ms
initial connection time = 38.624 ms
tps = 629.741560 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 16
number of threads: 1
maximum number of tries: 1
number of transactions per client: 62
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 27.225 ms
initial connection time = 93.374 ms
tps = 587.689911 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 16
number of threads: 1
maximum number of tries: 1
number of transactions per client: 62
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 27.286 ms
initial connection time = 144.455 ms
tps = 586.381988 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 32
number of threads: 1
maximum number of tries: 1
number of transactions per client: 31
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 62.284 ms
initial connection time = 167.298 ms
tps = 513.771617 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 32
number of threads: 1
maximum number of tries: 1
number of transactions per client: 31
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 68.779 ms
initial connection time = 149.849 ms
tps = 465.260910 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 64
number of threads: 1
maximum number of tries: 1
number of transactions per client: 16
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 137.629 ms
initial connection time = 395.633 ms
tps = 465.018485 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 64
number of threads: 1
maximum number of tries: 1
number of transactions per client: 16
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 126.522 ms
initial connection time = 204.470 ms
tps = 505.839382 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 128
number of threads: 1
maximum number of tries: 1
number of transactions per client: 8
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 367.755 ms
initial connection time = 629.566 ms
tps = 348.058165 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 128
number of threads: 1
maximum number of tries: 1
number of transactions per client: 8
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 377.889 ms
initial connection time = 307.864 ms
tps = 338.723693 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 256
number of threads: 1
maximum number of tries: 1
number of transactions per client: 4
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 1068.548 ms
initial connection time = 738.608 ms
tps = 239.577445 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 256
number of threads: 1
maximum number of tries: 1
number of transactions per client: 4
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 1130.504 ms
initial connection time = 531.634 ms
tps = 226.447673 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 512
number of threads: 1
maximum number of tries: 1
number of transactions per client: 2
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 3743.570 ms
initial connection time = 1346.164 ms
tps = 136.767863 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 512
number of threads: 1
maximum number of tries: 1
number of transactions per client: 2
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 3651.389 ms
initial connection time = 899.303 ms
tps = 140.220631 (without initial connection time)