test128.txt
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 500
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 2.669 ms
initial connection time = 3.511 ms
tps = 749.269649 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 500
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 2.848 ms
initial connection time = 4.674 ms
tps = 702.362114 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 250
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 5.427 ms
initial connection time = 6.987 ms
tps = 737.077737 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 250
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 5.213 ms
initial connection time = 7.081 ms
tps = 767.319553 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 125
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 12.177 ms
initial connection time = 25.428 ms
tps = 656.998712 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 125
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
latency average = 13.231 ms
initial connection time = 16.485 ms
tps = 604.658897 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 16
number of threads: 1
maximum number of tries: 1
number of transactions per client: 62
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 27.792 ms
initial connection time = 26.200 ms
tps = 575.712589 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 16
number of threads: 1
maximum number of tries: 1
number of transactions per client: 62
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 25.231 ms
initial connection time = 27.911 ms
tps = 634.131218 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 32
number of threads: 1
maximum number of tries: 1
number of transactions per client: 31
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 59.690 ms
initial connection time = 49.775 ms
tps = 536.102331 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 32
number of threads: 1
maximum number of tries: 1
number of transactions per client: 31
number of transactions actually processed: 992/992
number of failed transactions: 0 (0.000%)
latency average = 61.408 ms
initial connection time = 63.105 ms
tps = 521.103100 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 64
number of threads: 1
maximum number of tries: 1
number of transactions per client: 16
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 130.949 ms
initial connection time = 115.050 ms
tps = 488.738258 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 64
number of threads: 1
maximum number of tries: 1
number of transactions per client: 16
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 146.253 ms
initial connection time = 103.368 ms
tps = 437.596739 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 128
number of threads: 1
maximum number of tries: 1
number of transactions per client: 8
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 291.511 ms
initial connection time = 198.365 ms
tps = 439.091492 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 128
number of threads: 1
maximum number of tries: 1
number of transactions per client: 8
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 311.987 ms
initial connection time = 204.434 ms
tps = 410.273834 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 256
number of threads: 1
maximum number of tries: 1
number of transactions per client: 4
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 915.783 ms
initial connection time = 417.377 ms
tps = 279.542206 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 256
number of threads: 1
maximum number of tries: 1
number of transactions per client: 4
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 943.849 ms
initial connection time = 399.786 ms
tps = 271.229754 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 512
number of threads: 1
maximum number of tries: 1
number of transactions per client: 2
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 3587.660 ms
initial connection time = 913.103 ms
tps = 142.711425 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 512
number of threads: 1
maximum number of tries: 1
number of transactions per client: 2
number of transactions actually processed: 1024/1024
number of failed transactions: 0 (0.000%)
latency average = 4279.663 ms
initial connection time = 945.080 ms
tps = 119.635602 (without initial connection time)